"""Texts for the bot."""
ERROR_USER_INFO = "Ошибка: не удалось получить информацию о пользователе."
ERROR_AMOUNT_NOT_VALID = (
    "К сожалению, введенное количество затраченных средств"
    " не является валидным. Пожалуйста, повторите попытку"
)
ERROR_NAME_NOT_VALID = (
    "К сожалению, введенное название траты не является валидным."
    "Пожалуйста, повторите попытку."
)
COMMAND_NOT_RECOGNIZED = "Команда не распознана.\nПожалуйста, используйте /start или кнопки ниже."
ERROR_USER_CURRENCY = (
    "Ошибка: не удалось получить выбранную валюту.\n"
    "Возможно у вас не выбрана валюта, выберите, пожалуйста в настройках."
)
# buttons
ADD_EXPENSE_BUTTON = "Добавить трату"
SHOW_EXPENSES_BUTTON = "Показать траты за определенное время"
EDIT_SETTINGS_BUTTON = "Изменить настройки"
MAIN_MENU_BUTTON = "Главное меню"

# other texts
START_MESSAGE = (
    "Рады приветствовать Вас в боте для отслеживания ваших трат!\n\n"
)

GET_AMOUNT_MESSAGE = "Введите количество затраченных {currency}.\n\nЕсли хотите изменить валюту, то зайдите в настройки"
GET_EXPENSE_NAME = "Введите пожалуйста название для данного расхода."
CHOOSE_CATEGORY = (
    "Пожалуйста, выберите категорию из списка ниже.\n\n"
    "В случае, если нужной категории не хватает, то перейдите в настройки и добавьте"
)
